InformationRegisters/моп_ПравилаЗаполненияФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>моп_ПравилаЗаполненияФорм</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьДанныеИзДополнительныхСчетовФактур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:EnumRef.моп_ПравилаЗаполненияФорм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/моп_ПравилаЗаполненияФорм/Ext/ManagerModule.bsl
Функция ОтчетыПоЭкспортуНаДатуТД(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	моп_ПравилаЗаполненияФормСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.моп_ПравилаЗаполненияФорм.СрезПоследних(&Дата, Правило = ЗНАЧЕНИЕ(Перечисление.моп_ПравилаЗаполненияФорм.ОтчетыПоЭкспортуНаДатуТД)) КАК моп_ПравилаЗаполненияФормСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Следующий();
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции
